<a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>

In [2]:
import pandas as pd

# search by row

## row by index

In [8]:
friend_dict = {'name': ['John', 'Jenny', 'Nate'],
               'age' : [20,30,30],
               'job' : ['student', 'developer', 'teacher']
               }
df = pd.DataFrame(friend_dict)
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

sequential

In [10]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

nonsquential

In [11]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

##  row by column's Values

In [13]:
df_filtered = df.age > 25
df_filtered

0    False
1     True
2     True
Name: age, dtype: bool

In [14]:
df[df_filtered]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [17]:
df_filtered2 = df.name =='Nate'
df_filtered2

0    False
1    False
2     True
Name: name, dtype: bool

In [18]:
df[df_filtered & df_filtered2]

   name  age      job
2  Nate   30  teacher

In [28]:
df[(df.age >25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

## query()

In [15]:
df.query('age > 25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [27]:
df.query('(age > 25) and (name == "Nate")')

   name  age      job
2  Nate   30  teacher

# search by Columns

In [38]:
friend_list = [ ['John', 20, 'student','Seoul'],
               ['Jenny', 30, 'developer','Busan'],
               ['Nate', 30, 'teacher', 'Incheon'] ]
df = pd.DataFrame(friend_list, columns=['Name', 'Age', 'job', 'Address'])
df

    Name  Age        job  Address
0   John   20    student    Seoul
1  Jenny   30  developer    Busan
2   Nate   30    teacher  Incheon

## columns by index

sequential

In [43]:
df.iloc[:, 0:3]

    Name  Age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

nonsequential

In [44]:
df.iloc[:, [0,3]]

    Name  Address
0   John    Seoul
1  Jenny    Busan
2   Nate  Incheon

##  columns by name

In [46]:
df['Name']

0     John
1    Jenny
2     Nate
Name: Name, dtype: object

* 오직 컬럼 by name은 로우별로 찾는 방식은 없다.

In [47]:
df[['Name', 'Address']]

    Name  Address
0   John    Seoul
1  Jenny    Busan
2   Nate  Incheon

* `df.filter(like=)`columns by name which is cotaining

In [48]:
# select columns containing 'a'
df.filter(like='a',axis=1)

    Name
0   John
1  Jenny
2   Nate

In [52]:
df.filter(like='A', axis=1)

   Age  Address
0   20    Seoul
1   30    Busan
2   30  Incheon

Regular Expression also available

In [53]:
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher

In [55]:
df.index = ['AAA','BBA','ABC']
df

      Name  Age        job  Address
AAA   John   20    student    Seoul
BBA  Jenny   30  developer    Busan
ABC   Nate   30    teacher  Incheon

물론 axis = 0 으로 하면 index로 row를 검색하는것도 가능하다

In [57]:
df.filter(like='B', axis=0)

      Name  Age        job  Address
BBA  Jenny   30  developer    Busan
ABC   Nate   30    teacher  Incheon

In [58]:
df.filter(regex='C$', axis=0)

     Name  Age      job  Address
ABC  Nate   30  teacher  Incheon

# search with `query()`

In [1]:
maxx = df["W"].max()
print("\nValues which are less than maximum value of 'W' column")
print(df.query("W < @maxx"))

NameError: name 'df' is not defined

출처: 
* <a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>


<br>


* [이수안컴퓨터연구소](https://www.youtube.com/channel/UCFfALXX0DOx7zv6VeR5U_Bg)
* https://github.com/minsuk-heo/pandas